In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [9]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

      title
year
1894      1
1898      1
1899      1
1900      4
1903      1
...     ...
2022     18
2023     13
2024      3
2025      2
2026      2

[127 rows x 1 columns]

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [32]:
titles.groupby(titles.year // 10 * 10).size()

year
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

In [36]:
# Verify by filtering 
titles.groupby(['year']).count()

      title
year
1894      1
1898      1
1899      1
1900      4
1903      1
...     ...
2022     18
2023     13
2024      3
2025      2
2026      2

[127 rows x 1 columns]

### Use groupby() count the number of "Hamlet" films made in each decade.

In [55]:
Filter = titles[titles['title'] == 'Hamlet'] # apply filter for hamlet
Filter.title.groupby(Filter.year // 10 * 10).count() # group by decade and count

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: title, dtype: int64

In [62]:
Filter.sort_values(by=['year'], ascending = True)

         title  year
46721   Hamlet  1910
209878  Hamlet  1911
166410  Hamlet  1913
98554   Hamlet  1921
6009    Hamlet  1948
128388  Hamlet  1954
182970  Hamlet  1964
122704  Hamlet  1969
221479  Hamlet  1973
92146   Hamlet  1976
94355   Hamlet  1987
45350   Hamlet  1990
201291  Hamlet  1996
94554   Hamlet  2000
176069  Hamlet  2009
102919  Hamlet  2011
223568  Hamlet  2014
168965  Hamlet  2015

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [75]:
#cast.head() (cast['type'] == 'actress') & 
filters = cast[(cast['n'] == 1) & (cast['year'] >= 1950) & (cast['year'] < 1960)]
# filter1 = cast[cast['type'] == 'actress']
filters
filters.groupby(filters.type).count()

         title  year  name  character     n
type
actor     6616  6616  6616       6616  6616
actress   2965  2965  2965       2965  2965

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

### List each of the characters that Frank Oz has portrayed at least twice.